OdDAI.Number.isReal
\details
Verifying if Number is double.
\returns true if Number value type is double, otherwise returns false

OdDAI.Number.isInteger
\details
Verifying if Number is integer.
\returns true if Number value type is integer, otherwise returns false

OdDAI.Number.tryGetReal(System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Gets double value from Number.
\param getTo [out] double value.
\returns true if Number value type is double, otherwise returns false

OdDAI.Number.tryGetInteger(System.Int32*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Gets integer value from Number.
\param getTo [out] integer value.
\returns true if Number value type is integer, otherwise returns false

OdDAI.Number.setReal(System.Double!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets double type for Number.
\param setFrom [in] new double value for Number.

OdDAI.Number.getReal
\details
Provides double type for Number.
\returns double value if it placed at Number; otherwise, the method throw the exception.
\remarks
if Number does not real exception should be thrown.

OdDAI.Number.setInteger(System.Int32)
\details
Sets integer type for Number.
\param setFrom [in] new integer value for Number.

OdDAI.Number.getInteger
\details
Provides integer type for Number.
\returns integer value if it placed at Number; otherwise, the method throw the exception.
\remarks
if Number does not integer exception should be thrown.

OdDAI.Number.exists
\details
Shows the current status of the value.
\returns true if Number is not empty; otherwise return false.

OdDAI.Number.nullify
\details
Reset Number to unset state

OdDAI.Number.getUnderlyingType
\details
Provides current value type for Number.
\returns the named type of settled value. If value is not set the function should returns nullptr.

OdDAI.Number.underlyingTypeName(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the name of the underlying type for the Number object.
\param typeName [in] An ANSI string that contains the type name to be set.
\returns true if the underlying type was changed; otherwise, the method return false.

OdDAI.Number.underlyingTypeName
\details
Provides the name of the current value type for Number.
\returns name of the settled value. If value is not set the function should returns empty string.

OdDAI.Number.kind
\details
Provides OdTCKind of the number.
\returns kind of the number.

OdDAI.Number.op_Equality(System.Double!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
An equality operator for the Number data type.
\param compareTo [in] Another Number object to be compared with (the right-hand operand of the comparison operation).
\returns true if Number objects are equal; otherwise, the method returns false.

OdDAI.Number.op_Equality(System.Int32!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
An equality operator for the Number data type.
\param compareTo [in] Another Number object to be compared with (the right-hand operand of the comparison operation).
\returns true if Number objects are equal; otherwise, the method returns false.

OdDAI.Number.op_Equality(OdDAI.Number!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
An equality operator for the Number data type.
\param compareTo [in] Another Number object to be compared with (the right-hand operand of the comparison operation).
\returns true if Number objects are equal; otherwise, the method returns false.

OdDAI.Number.op_Inequality(OdDAI.Number!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Not equal operator for the Number data type.
\param compareTo [in] Another Number object to be compared with (the right-hand operand of the comparison operation).
\returns true if Number objects are not equal; otherwise, the method returns false.

OdDAI.Number.op_LessThan(OdDAI.Number!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Less than operator for the Number data type.
\param compareTo [in] Another Number object to be compared with (the right-hand operand of the comparison operation).
\returns true if Number objects are less; otherwise, the method returns false.

OdDAI.Number.op_Assign(System.Int32!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assignment operator for the int data type.
The operator casts specified int value to the Number value and assigns it to the object.
\param applyFrom [in] A int data type value to be assigned (a right-hand operand of the assignment operation).
\returns The reference to the Number object modified by the assignment operation.

OdDAI.Number.op_Assign(System.Double!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assignment operator for the double data type.
The operator casts specified double value to the Number value and assigns it to the object.
\param applyFrom [in] A double data type value to be assigned (a right-hand operand of the assignment operation).
\returns The reference to the Number object modified by the assignment operation.

OdDAI.Number.op_Assign(OdDAI.Number!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assignment operator for the Number data type.
\param applyFrom [in] A Number data type value to be assigned (a right-hand operand of the assignment operation).
\returns The reference to the Number object modified by the assignment operation.

OdDAI.Number.#ctor
\details
Creates a new Number object with the default value.

OdDAI.Number.Unset
An unset value of the primitive Number data type.

OdDAI.Number
\details
A class that represents the SDAI primitive Number data type.